In [14]:
print('start')

start

In [15]:
import pandas as pd

data = {
    'Name': ['Alice', 'Bob', 'Charlie', 'David', 'Eva'],
    'Age': [25, 30, 35, 40, 45],
    'City': ['New York', 'Los Angeles', 'Chicago', 'Houston', 'Phoenix'],
    'Salary': [70000, 80000, 75000, 90000, 85000]
}

df = pd.DataFrame(data)
df

      Name  Age         City  Salary
0    Alice   25     New York   70000
1      Bob   30  Los Angeles   80000
2  Charlie   35      Chicago   75000
3    David   40      Houston   90000
4      Eva   45      Phoenix   85000

In [19]:
# Add a new column Years_of_Experience to the DataFrame where the values are [2, 5, 8, 10, 12]

df['Years_of_Experience']=[2, 5, 8, 10, 12]
df

      Name  Age         City  Salary  Years_of_Experience
0    Alice   25     New York   70000                    2
1      Bob   30  Los Angeles   80000                    5
2  Charlie   35      Chicago   75000                    8
3    David   40      Houston   90000                   10
4      Eva   45      Phoenix   85000                   12

In [23]:
# Filter the DataFrame to show only the rows where the Age is greater than 30.
above_age= df[df['Age']>30]
above_age

      Name  Age     City  Salary  Years_of_Experience
2  Charlie   35  Chicago   75000                    8
3    David   40  Houston   90000                   10
4      Eva   45  Phoenix   85000                   12

In [47]:
# What is the average Salary of people living in cities starting with the letter 'C'?
info = df[df['City'].str.startswith('C')]
info['avg_salary']= info['Salary'].mean()
info

      Name  Age     City  Salary  Years_of_Experience  avg_salary
2  Charlie   35  Chicago   75000                    8     75000.0